## Staging: eks
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 11 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                 NAME                                  |
|--------|-----------------------------------------------------------------------|
| add    | `aws_cloudwatch_log_group.notification-canada-ca-eks-prometheus-logs` |
|        | `aws_cloudwatch_log_metric_filter.admin-evicted-pods`                 |
|        | `aws_cloudwatch_log_metric_filter.api-evicted-pods`                   |
|        | `aws_cloudwatch_log_metric_filter.celery-evicted-pods`                |
|        | `aws_cloudwatch_log_metric_filter.document-download-evicted-pods`     |
|        | `aws_cloudwatch_log_metric_filter.documentation-evicted-pods`         |
|        | `aws_cloudwatch_metric_alarm.admin-evicted-pods`                      |
|        | `aws_cloudwatch_metric_alarm.api-evicted-pods`                        |
|        | `aws_cloudwatch_metric_alarm.celery-evicted-pods`                     |
|        | `aws_cloudwatch_metric_alarm.document-download-evicted-pods`          |
|        | `aws_cloudwatch_metric_alarm.documentation-evicted-pods`              |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_cloudwatch_log_group.notification-canada-ca-eks-prometheus-logs will be created
  + resource "aws_cloudwatch_log_group" "notification-canada-ca-eks-prometheus-logs" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/containerinsights/notification-canada-ca-staging-eks-cluster/prometheus"
      + name_prefix       = (known after apply)
      + retention_in_days = 0
      + skip_destroy      = false
      + tags_all          = (known after apply)
    }

  # aws_cloudwatch_log_metric_filter.admin-evicted-pods will be created
  + resource "aws_cloudwatch_log_metric_filter" "admin-evicted-pods" {
      + id             = (known after apply)
      + log_group_name = "/aws/containerinsights/notification-canada-ca-staging-eks-cluster/prometheus"
      + name           = "admin-evicted-pods"
      + pattern        = "{ ($.reason = \"Evicted\") && ($.kube_pod_status_reason = 1) && ($.pod = \"admin-*\") }"

      + metric_transformation {
          + name      = "admin-evicted-pods"
          + namespace = "LogMetrics"
          + unit      = "None"
          + value     = "1"
        }
    }

  # aws_cloudwatch_log_metric_filter.api-evicted-pods will be created
  + resource "aws_cloudwatch_log_metric_filter" "api-evicted-pods" {
      + id             = (known after apply)
      + log_group_name = "/aws/containerinsights/notification-canada-ca-staging-eks-cluster/prometheus"
      + name           = "api-evicted-pods"
      + pattern        = "{ ($.reason = \"Evicted\") && ($.kube_pod_status_reason = 1) && ($.pod = \"api-*\") }"

      + metric_transformation {
          + name      = "api-evicted-pods"
          + namespace = "LogMetrics"
          + unit      = "None"
          + value     = "1"
        }
    }

  # aws_cloudwatch_log_metric_filter.celery-evicted-pods will be created
  + resource "aws_cloudwatch_log_metric_filter" "celery-evicted-pods" {
      + id             = (known after apply)
      + log_group_name = "/aws/containerinsights/notification-canada-ca-staging-eks-cluster/prometheus"
      + name           = "celery-evicted-pods"
      + pattern        = "{ ($.reason = \"Evicted\") && ($.kube_pod_status_reason = 1) && ($.pod = \"celery-*\") }"

      + metric_transformation {
          + name      = "celery-evicted-pods"
          + namespace = "LogMetrics"
          + unit      = "None"
          + value     = "1"
        }
    }

  # aws_cloudwatch_log_metric_filter.document-download-evicted-pods will be created
  + resource "aws_cloudwatch_log_metric_filter" "document-download-evicted-pods" {
      + id             = (known after apply)
      + log_group_name = "/aws/containerinsights/notification-canada-ca-staging-eks-cluster/prometheus"
      + name           = "document-download-evicted-pods"
      + pattern        = "{ ($.reason = \"Evicted\") && ($.kube_pod_status_reason = 1) && ($.pod = \"document-download-*\") }"

      + metric_transformation {
          + name      = "document-download-evicted-pods"
          + namespace = "LogMetrics"
          + unit      = "None"
          + value     = "1"
        }
    }

  # aws_cloudwatch_log_metric_filter.documentation-evicted-pods will be created
  + resource "aws_cloudwatch_log_metric_filter" "documentation-evicted-pods" {
      + id             = (known after apply)
      + log_group_name = "/aws/containerinsights/notification-canada-ca-staging-eks-cluster/prometheus"
      + name           = "documentation-evicted-pods"
      + pattern        = "{ ($.reason = \"Evicted\") && ($.kube_pod_status_reason = 1) && ($.pod = \"documentation-*\") }"

      + metric_transformation {
          + name      = "documentation-evicted-pods"
          + namespace = "LogMetrics"
          + unit      = "None"
          + value     = "1"
        }
    }

  # aws_cloudwatch_metric_alarm.admin-evicted-pods will be created
  + resource "aws_cloudwatch_metric_alarm" "admin-evicted-pods" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-warning",
        ]
      + alarm_description                     = "One or more Kubernetes Admin Pods is reporting as Evicted"
      + alarm_name                            = "evicted-admin-pods-detected"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + insufficient_data_actions             = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-warning",
        ]
      + metric_name                           = "admin-evicted-pods"
      + namespace                             = "LogMetrics"
      + ok_actions                            = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-warning",
        ]
      + period                                = 60
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 1
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.api-evicted-pods will be created
  + resource "aws_cloudwatch_metric_alarm" "api-evicted-pods" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-warning",
        ]
      + alarm_description                     = "One or more Kubernetes API Pods is reporting as Evicted"
      + alarm_name                            = "evicted-api-pods-detected"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + insufficient_data_actions             = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-warning",
        ]
      + metric_name                           = "api-evicted-pods"
      + namespace                             = "LogMetrics"
      + ok_actions                            = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-warning",
        ]
      + period                                = 60
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 1
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.celery-evicted-pods will be created
  + resource "aws_cloudwatch_metric_alarm" "celery-evicted-pods" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-warning",
        ]
      + alarm_description                     = "One or more Kubernetes Celery Pods is reporting as Evicted"
      + alarm_name                            = "evicted-celery-pods-detected"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + insufficient_data_actions             = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-warning",
        ]
      + metric_name                           = "celery-evicted-pods"
      + namespace                             = "LogMetrics"
      + ok_actions                            = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-warning",
        ]
      + period                                = 60
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 1
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.document-download-evicted-pods will be created
  + resource "aws_cloudwatch_metric_alarm" "document-download-evicted-pods" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-warning",
        ]
      + alarm_description                     = "One or more Kubernetes Document Download Pods is reporting as Evicted"
      + alarm_name                            = "evicted-document-download-pods-detected"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + insufficient_data_actions             = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-warning",
        ]
      + metric_name                           = "document-download-evicted-pods"
      + namespace                             = "LogMetrics"
      + ok_actions                            = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-warning",
        ]
      + period                                = 60
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 1
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.documentation-evicted-pods will be created
  + resource "aws_cloudwatch_metric_alarm" "documentation-evicted-pods" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-warning",
        ]
      + alarm_description                     = "One or more Kubernetes Documentation Pods is reporting as Evicted"
      + alarm_name                            = "evicted-documentation-pods-detected"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + insufficient_data_actions             = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-warning",
        ]
      + metric_name                           = "documentation-evicted-pods"
      + namespace                             = "LogMetrics"
      + ok_actions                            = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-warning",
        ]
      + period                                = 60
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 1
      + treat_missing_data                    = "notBreaching"
    }

Plan: 11 to add, 0 to change, 0 to destroy.

Warning: Argument is deprecated

  with aws_wafv2_web_acl.notification-canada-ca,
  on waf.tf line 1, in resource "aws_wafv2_web_acl" "notification-canada-ca":
   1: resource "aws_wafv2_web_acl" "notification-canada-ca" {

Use rule_action_override instead

(and one more similar warning elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.notification-canada-ca-alt[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_listener.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-admin"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-api"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-document"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-document-api"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-documentation"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-application-logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-cluster-logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-prometheus-logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.admin-evicted-pods"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.admin-pods-high-cpu-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.admin-pods-high-memory-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.admin-replicas-unavailable"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.api-evicted-pods"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.api-pods-high-cpu-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.api-pods-high-memory-warning"]
WARN - plan.json - main -...
```

</details>
